app/views/static_pages/home.html.erb

          <p class="card-text">
            <strong>Par :</strong> <%= gossip.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 2, 8, 1, 5, 10, 3, 9, 7)

            <span><small>Likes : <%= gossip.likes.count %></small></span>
            <span><small>Commentaires : <%= gossip.comments.count %></small></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = 1