app/views/users/new.html.erb

SELECT "cities".* FROM "cities"
---
      <%= f.label :city %>
      <%= f.collection_select :city_id, City.all, :id, :name %>