app/views/users/show.html.erb

      <ul >
        <% @user.gossips.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = 2