app/views/gossips/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 4, 5, 9, 2, 8, 6, 7)
---
          <p class="card-text">
            <strong>Par :</strong> <%= gossip.user.first_name %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = 1
---
            <span><small>Likes : <%= gossip.likes.count %></small></span>
            <span><small>Commentaires : <%= gossip.comments.count %></small></span>

SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = 1
---
        <div class="card-footer">
          <p><small>Commentaires : <%= gossip.comments.count %></small></p>