app/views/gossips/new.html.erb

    <%= label_tag 'gossip_user_id', 'Choisir un utilisateur' %>
    <%= select_tag 'gossip[user_id]', options_from_collection_for_select(User.all, :id, :first_name), class: "form-select" %>
---
SELECT "users".* FROM "users"

    <%= label_tag 'tag_ids', 'Choisir un ou plusieurs tags' %>
    <%= select_tag 'tag_ids[]', options_from_collection_for_select(Tag.all, :id, :title), multiple: true, class: "form-select" %>
---
SELECT "tags".* FROM "tags"