app/views/gossips/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = 1
---

      <% @gossip.comments.each do |comment| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
          <hr>
          <p><strong>Auteur :</strong> <%= comment.user.first_name %></p>