app/controllers/comments_controller.rb

  def create
    @gossip = Gossip.find(params[:gossip_id])
    @comment = @gossip.comments.build(comment_params)
    @comment.user = User.find_by(email: "anonyme@example.com")

    if @comment.save
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = 'anonyme@example.com' LIMIT 1
INSERT INTO "comments" ("content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ('un commentaire test', 11, 1, '2025-06-11 13:14:44.544180', '2025-06-11 13:14:44.544180') RETURNING "id"

  def update
    @comment = Comment.find(params[:id])
    if
      @comment.update(comment_params)
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 21 LIMIT 1
UPDATE "comments" SET "content" = 'un commentaire test après modification', "updated_at" = '2025-06-11 13:19:28.154278' WHERE "comments"."id" = 21