app/controllers/gossips_controller.rb

  def index
    @gossips = Gossip.includes(:user).all
---
SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 4, 5, 9, 2, 8, 6, 7)

  def show
    @gossip = Gossip.includes(user: :city).find(params[:id])
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = 6
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 1 LIMIT 1

  def new
    @gossip = Gossip.new
    @tags = Tag.all
---
SELECT "tags".* FROM "tags"

  def create

    @gossip = Gossip.new(gossip_params)


    if @gossip.save
       if params[:tag_ids].present?
        tag_ids = params[:tag_ids].reject(&:blank?)
        @gossip.tags << Tag.where(id: tag_ids)
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ('test de potin avec tag', 'nouveau potin avec tag', 1, '2025-06-11 14:41:46.915159', '2025-06-11 14:41:46.915159') RETURNING "id"
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 1 LIMIT 1
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ('test de potin par le current_user', 'blablabla blablablablablablablabla bblablablabla', 13, '2025-06-12 13:31:37.622410', '2025-06-12 13:31:37.622410') RETURNING "id"
INSERT INTO "gossip_tags" ("gossip_id", "tag_id", "created_at", "updated_at") VALUES (21, 4, '2025-06-11 14:41:46.958164', '2025-06-11 14:41:46.958164') RETURNING "id"
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (4, 5)

  def edit
    @gossip = Gossip.find(params[:id])
    @tags =Tag.all
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 1 LIMIT 1
SELECT "tags".* FROM "tags"

  def update
   @gossip = Gossip.find(params[:id])
    if @gossip.update(gossip_params)
      if params[:tag_ids].present?
        tag_ids = params[:tag_ids].reject(&:blank?)
        @gossip.tags = Tag.where(id: tag_ids)
      else
        @gossip.tags.clear
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 1 LIMIT 1
UPDATE "gossips" SET "title" = 'Postern of Fate 1', "updated_at" = '2025-06-11 09:10:36.655933' WHERE "gossips"."id" = 1
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 2 LIMIT 1
SELECT "tags".* FROM "tags" INNER JOIN "gossip_tags" ON "tags"."id" = "gossip_tags"."tag_id" WHERE "gossip_tags"."gossip_id" = 1
DELETE FROM "gossips" WHERE "gossips"."id" = 2
DELETE FROM "gossip_tags" WHERE "gossip_tags"."gossip_id" = 21 AND "gossip_tags"."tag_id" IN (4, 5)