app/controllers/likes_controller.rb

INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "user_id") VALUES ('Gossip', 1, '2025-06-12 15:22:12.624062', '2025-06-12 15:22:12.624062', 11) RETURNING "id"
---
 def create
    @likeable = find_likeable
    @like = @likeable.likes.build(user: current_user)
    if @like.save

DELETE FROM "likes" WHERE "likes"."id" = 1
---
  def destroy
    @likeable = find_likeable
    @like = @likeable.likes.find_by(user: current_user)
    if @like
      @like.destroy

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = 1 LIMIT 1
---
  def find_likeable
    if params[:gossip_id]
      Gossip.find(params[:gossip_id])