app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'anonyme@example.com' LIMIT 1
---
  def create
    # cherche s'il existe un utilisateur en base avec l’e-mail
    user = User.find_by(email: email_dans_ton_params)