app/controllers/static_pages_controller.rb

  def home
    @gossips = Gossip.includes(:user).all
---
SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 2, 8, 1, 5, 10, 3, 9, 7)