app/controllers/users_controller.rb

SELECT "cities".* FROM "cities" WHERE "cities"."id" = 1
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = 13
SELECT "users".* FROM "users" WHERE "users"."id" = 13 LIMIT 1
---
  def show
    @user = User.includes(:city, :gossips).find(params[:id])

INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "created_at", "updated_at", "city_id", "password_digest") VALUES ('essai', 'un', 'teste de creer un compte', 'test1@test.com', 24, '2025-06-12 12:32:54.403821', '2025-06-12 12:32:54.403821', 1, '$2a$12$WFvKRcf67xIqBMXSGtJfN.U6XVMWoA1LksYuR1XvzC5msF8GyfwlK') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save