app/views/cities/show.html.erb

            <%= link_to user_path(gossip.user.id), class: "text-decoration-none custom-links" do %>
              <strong><%= gossip.user.first_name %> <%= gossip.user.last_name %></strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

          <div class="d-flex flex-wrap gap-2 mt-3 mb-2">
            <% gossip.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "gossip_tags" ON "tags"."id" = "gossip_tags"."tag_id" WHERE "gossip_tags"."gossip_id" = 1

            <span><small>Likes : <%= gossip.likes.count %></small></span>
            <span><small>Commentaires : <%= gossip.comments.count %></small></span>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = 1